# GBXMLExport Options Constructor

Source: https://www.revitapidocs.com/2026/a4714450-fa1f-8f63-c3e3-ff4c195d662e.htm

---

| GBXMLExport Options Constructor |
| --- |

Constructs a new instance of the options used to export a model in gbXML (Green Building XML) format.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public GBXMLExportOptions()
```

```
Public Sub New
```

```
public:
GBXMLExportOptions()
```

```
new : unit -> GBXMLExportOptions
```
See Also

#### Reference

GBXMLExportOptions Class Autodesk.Revit.DB Namespace